7767517
339 420
Input                    in0                      0 1 in0
Convolution              conv_21                  1 1 in0 1 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864
GELU                     gelu_108                 1 1 1 2
Convolution              conv_22                  1 1 2 3 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Split                    splitncnn_0              1 3 3 4 5 6
ConvolutionDepthWise     convdw_177               1 1 6 7 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
ConvolutionDepthWise     convdw_178               1 1 5 8 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 7=64
BinaryOp                 add_0                    2 1 7 8 9 0=0
BinaryOp                 add_1                    2 1 9 4 10 0=0
BatchNorm                bn_0                     1 1 10 11 0=64 1=1.000000e-05
Split                    splitncnn_1              1 2 11 12 13
Reduction                mean_168                 1 1 13 14 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_0               1 1 14 15 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              convsigmoid_16           1 1 15 16 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=4
BinaryOp                 mul_2                    2 1 12 16 17 0=2
Split                    splitncnn_2              1 2 17 18 19
Convolution              conv_25                  1 1 19 20 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
GELU                     gelu_109                 1 1 20 21
Convolution              conv_26                  1 1 21 22 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_3                    2 1 18 22 23 0=0
Split                    splitncnn_3              1 3 23 24 25 26
ConvolutionDepthWise     convdw_179               1 1 26 27 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
ConvolutionDepthWise     convdw_180               1 1 25 28 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 7=64
BinaryOp                 add_4                    2 1 27 28 29 0=0
BinaryOp                 add_5                    2 1 29 24 30 0=0
BatchNorm                bn_1                     1 1 30 31 0=64 1=1.000000e-05
Split                    splitncnn_4              1 2 31 32 33
Convolution              conv_27                  1 1 33 34 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
GELU                     gelu_110                 1 1 34 35
Convolution              conv_28                  1 1 35 36 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_6                    2 1 32 36 37 0=0
Split                    splitncnn_5              1 3 37 38 39 40
ConvolutionDepthWise     convdw_181               1 1 40 41 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
ConvolutionDepthWise     convdw_182               1 1 39 42 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 7=64
BinaryOp                 add_7                    2 1 41 42 43 0=0
BinaryOp                 add_8                    2 1 43 38 44 0=0
BatchNorm                bn_2                     1 1 44 45 0=64 1=1.000000e-05
Split                    splitncnn_6              1 2 45 46 47
Convolution              conv_29                  1 1 47 48 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
GELU                     gelu_111                 1 1 48 49
Convolution              conv_30                  1 1 49 50 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_9                    2 1 46 50 51 0=0
Split                    splitncnn_7              1 2 51 52 53
ConvolutionDepthWise     convdw_183               1 1 53 54 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=576 7=64
Convolution              conv_31                  1 1 54 55 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Split                    splitncnn_8              1 2 55 56 57
Convolution              conv_32                  1 1 57 58 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
GELU                     gelu_112                 1 1 58 59
Convolution              conv_33                  1 1 59 60 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_10                   2 1 56 60 61 0=0
Split                    splitncnn_9              1 3 61 62 63 64
ConvolutionDepthWise     convdw_184               1 1 64 65 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
ConvolutionDepthWise     convdw_185               1 1 63 66 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128 7=128
BinaryOp                 add_11                   2 1 65 66 67 0=0
BinaryOp                 add_12                   2 1 67 62 68 0=0
BatchNorm                bn_3                     1 1 68 69 0=128 1=1.000000e-05
Split                    splitncnn_10             1 2 69 70 71
Reduction                mean_169                 1 1 71 72 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_1               1 1 72 73 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convsigmoid_17           1 1 73 74 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=4
BinaryOp                 mul_13                   2 1 70 74 75 0=2
Split                    splitncnn_11             1 2 75 76 77
Convolution              conv_36                  1 1 77 78 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
GELU                     gelu_113                 1 1 78 79
Convolution              conv_37                  1 1 79 80 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_14                   2 1 76 80 81 0=0
Split                    splitncnn_12             1 3 81 82 83 84
ConvolutionDepthWise     convdw_186               1 1 84 85 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
ConvolutionDepthWise     convdw_187               1 1 83 86 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128 7=128
BinaryOp                 add_15                   2 1 85 86 87 0=0
BinaryOp                 add_16                   2 1 87 82 88 0=0
BatchNorm                bn_4                     1 1 88 89 0=128 1=1.000000e-05
Split                    splitncnn_13             1 2 89 90 91
Convolution              conv_38                  1 1 91 92 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
GELU                     gelu_114                 1 1 92 93
Convolution              conv_39                  1 1 93 94 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_17                   2 1 90 94 95 0=0
Split                    splitncnn_14             1 3 95 96 97 98
ConvolutionDepthWise     convdw_188               1 1 98 99 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
ConvolutionDepthWise     convdw_189               1 1 97 100 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128 7=128
BinaryOp                 add_18                   2 1 99 100 101 0=0
BinaryOp                 add_19                   2 1 101 96 102 0=0
BatchNorm                bn_5                     1 1 102 103 0=128 1=1.000000e-05
Split                    splitncnn_15             1 2 103 104 105
Convolution              conv_40                  1 1 105 106 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
GELU                     gelu_115                 1 1 106 107
Convolution              conv_41                  1 1 107 108 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_20                   2 1 104 108 109 0=0
Split                    splitncnn_16             1 2 109 110 111
ConvolutionDepthWise     convdw_190               1 1 111 112 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1152 7=128
Convolution              conv_42                  1 1 112 113 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Split                    splitncnn_17             1 2 113 114 115
Convolution              conv_43                  1 1 115 116 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_116                 1 1 116 117
Convolution              conv_44                  1 1 117 118 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_21                   2 1 114 118 119 0=0
Split                    splitncnn_18             1 3 119 120 121 122
ConvolutionDepthWise     convdw_191               1 1 122 123 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
ConvolutionDepthWise     convdw_192               1 1 121 124 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 7=256
BinaryOp                 add_22                   2 1 123 124 125 0=0
BinaryOp                 add_23                   2 1 125 120 126 0=0
BatchNorm                bn_6                     1 1 126 127 0=256 1=1.000000e-05
Split                    splitncnn_19             1 2 127 128 129
Reduction                mean_170                 1 1 129 130 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_2               1 1 130 131 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convsigmoid_18           1 1 131 132 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=4
BinaryOp                 mul_24                   2 1 128 132 133 0=2
Split                    splitncnn_20             1 2 133 134 135
Convolution              conv_47                  1 1 135 136 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_117                 1 1 136 137
Convolution              conv_48                  1 1 137 138 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_25                   2 1 134 138 139 0=0
Split                    splitncnn_21             1 3 139 140 141 142
ConvolutionDepthWise     convdw_193               1 1 142 143 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
ConvolutionDepthWise     convdw_194               1 1 141 144 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 7=256
BinaryOp                 add_26                   2 1 143 144 145 0=0
BinaryOp                 add_27                   2 1 145 140 146 0=0
BatchNorm                bn_7                     1 1 146 147 0=256 1=1.000000e-05
Split                    splitncnn_22             1 2 147 148 149
Convolution              conv_49                  1 1 149 150 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_118                 1 1 150 151
Convolution              conv_50                  1 1 151 152 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_28                   2 1 148 152 153 0=0
Split                    splitncnn_23             1 3 153 154 155 156
ConvolutionDepthWise     convdw_195               1 1 156 157 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
ConvolutionDepthWise     convdw_196               1 1 155 158 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 7=256
BinaryOp                 add_29                   2 1 157 158 159 0=0
BinaryOp                 add_30                   2 1 159 154 160 0=0
BatchNorm                bn_8                     1 1 160 161 0=256 1=1.000000e-05
Split                    splitncnn_24             1 2 161 162 163
Reduction                mean_171                 1 1 163 164 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_3               1 1 164 165 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convsigmoid_19           1 1 165 166 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=4
BinaryOp                 mul_31                   2 1 162 166 167 0=2
Split                    splitncnn_25             1 2 167 168 169
Convolution              conv_53                  1 1 169 170 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_119                 1 1 170 171
Convolution              conv_54                  1 1 171 172 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_32                   2 1 168 172 173 0=0
Split                    splitncnn_26             1 3 173 174 175 176
ConvolutionDepthWise     convdw_197               1 1 176 177 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
ConvolutionDepthWise     convdw_198               1 1 175 178 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 7=256
BinaryOp                 add_33                   2 1 177 178 179 0=0
BinaryOp                 add_34                   2 1 179 174 180 0=0
BatchNorm                bn_9                     1 1 180 181 0=256 1=1.000000e-05
Split                    splitncnn_27             1 2 181 182 183
Convolution              conv_55                  1 1 183 184 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_120                 1 1 184 185
Convolution              conv_56                  1 1 185 186 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_35                   2 1 182 186 187 0=0
Split                    splitncnn_28             1 3 187 188 189 190
ConvolutionDepthWise     convdw_199               1 1 190 191 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
ConvolutionDepthWise     convdw_200               1 1 189 192 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 7=256
BinaryOp                 add_36                   2 1 191 192 193 0=0
BinaryOp                 add_37                   2 1 193 188 194 0=0
BatchNorm                bn_10                    1 1 194 195 0=256 1=1.000000e-05
Split                    splitncnn_29             1 2 195 196 197
Reduction                mean_172                 1 1 197 198 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_4               1 1 198 199 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convsigmoid_20           1 1 199 200 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=4
BinaryOp                 mul_38                   2 1 196 200 201 0=2
Split                    splitncnn_30             1 2 201 202 203
Convolution              conv_59                  1 1 203 204 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_121                 1 1 204 205
Convolution              conv_60                  1 1 205 206 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_39                   2 1 202 206 207 0=0
Split                    splitncnn_31             1 3 207 208 209 210
ConvolutionDepthWise     convdw_201               1 1 210 211 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
ConvolutionDepthWise     convdw_202               1 1 209 212 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 7=256
BinaryOp                 add_40                   2 1 211 212 213 0=0
BinaryOp                 add_41                   2 1 213 208 214 0=0
BatchNorm                bn_11                    1 1 214 215 0=256 1=1.000000e-05
Split                    splitncnn_32             1 2 215 216 217
Convolution              conv_61                  1 1 217 218 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_122                 1 1 218 219
Convolution              conv_62                  1 1 219 220 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_42                   2 1 216 220 221 0=0
Split                    splitncnn_33             1 3 221 222 223 224
ConvolutionDepthWise     convdw_203               1 1 224 225 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
ConvolutionDepthWise     convdw_204               1 1 223 226 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 7=256
BinaryOp                 add_43                   2 1 225 226 227 0=0
BinaryOp                 add_44                   2 1 227 222 228 0=0
BatchNorm                bn_12                    1 1 228 229 0=256 1=1.000000e-05
Split                    splitncnn_34             1 2 229 230 231
Reduction                mean_173                 1 1 231 232 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_5               1 1 232 233 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convsigmoid_21           1 1 233 234 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=4
BinaryOp                 mul_45                   2 1 230 234 235 0=2
Split                    splitncnn_35             1 2 235 236 237
Convolution              conv_65                  1 1 237 238 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_123                 1 1 238 239
Convolution              conv_66                  1 1 239 240 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_46                   2 1 236 240 241 0=0
Split                    splitncnn_36             1 3 241 242 243 244
ConvolutionDepthWise     convdw_205               1 1 244 245 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
ConvolutionDepthWise     convdw_206               1 1 243 246 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 7=256
BinaryOp                 add_47                   2 1 245 246 247 0=0
BinaryOp                 add_48                   2 1 247 242 248 0=0
BatchNorm                bn_13                    1 1 248 249 0=256 1=1.000000e-05
Split                    splitncnn_37             1 2 249 250 251
Convolution              conv_67                  1 1 251 252 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_124                 1 1 252 253
Convolution              conv_68                  1 1 253 254 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_49                   2 1 250 254 255 0=0
Split                    splitncnn_38             1 3 255 256 257 258
ConvolutionDepthWise     convdw_207               1 1 258 259 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
ConvolutionDepthWise     convdw_208               1 1 257 260 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 7=256
BinaryOp                 add_50                   2 1 259 260 261 0=0
BinaryOp                 add_51                   2 1 261 256 262 0=0
BatchNorm                bn_14                    1 1 262 263 0=256 1=1.000000e-05
Split                    splitncnn_39             1 2 263 264 265
Reduction                mean_174                 1 1 265 266 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_6               1 1 266 267 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convsigmoid_22           1 1 267 268 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=4
BinaryOp                 mul_52                   2 1 264 268 269 0=2
Split                    splitncnn_40             1 2 269 270 271
Convolution              conv_71                  1 1 271 272 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_125                 1 1 272 273
Convolution              conv_72                  1 1 273 274 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_53                   2 1 270 274 275 0=0
Split                    splitncnn_41             1 3 275 276 277 278
ConvolutionDepthWise     convdw_209               1 1 278 279 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
ConvolutionDepthWise     convdw_210               1 1 277 280 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 7=256
BinaryOp                 add_54                   2 1 279 280 281 0=0
BinaryOp                 add_55                   2 1 281 276 282 0=0
BatchNorm                bn_15                    1 1 282 283 0=256 1=1.000000e-05
Split                    splitncnn_42             1 2 283 284 285
Convolution              conv_73                  1 1 285 286 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_126                 1 1 286 287
Convolution              conv_74                  1 1 287 288 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_56                   2 1 284 288 289 0=0
Split                    splitncnn_43             1 3 289 290 291 292
ConvolutionDepthWise     convdw_211               1 1 292 293 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
ConvolutionDepthWise     convdw_212               1 1 291 294 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 7=256
BinaryOp                 add_57                   2 1 293 294 295 0=0
BinaryOp                 add_58                   2 1 295 290 296 0=0
BatchNorm                bn_16                    1 1 296 297 0=256 1=1.000000e-05
Split                    splitncnn_44             1 2 297 298 299
Reduction                mean_175                 1 1 299 300 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_7               1 1 300 301 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convsigmoid_23           1 1 301 302 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=4
BinaryOp                 mul_59                   2 1 298 302 303 0=2
Split                    splitncnn_45             1 2 303 304 305
Convolution              conv_77                  1 1 305 306 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_127                 1 1 306 307
Convolution              conv_78                  1 1 307 308 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_60                   2 1 304 308 309 0=0
Split                    splitncnn_46             1 3 309 310 311 312
ConvolutionDepthWise     convdw_213               1 1 312 313 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
ConvolutionDepthWise     convdw_214               1 1 311 314 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 7=256
BinaryOp                 add_61                   2 1 313 314 315 0=0
BinaryOp                 add_62                   2 1 315 310 316 0=0
BatchNorm                bn_17                    1 1 316 317 0=256 1=1.000000e-05
Split                    splitncnn_47             1 2 317 318 319
Convolution              conv_79                  1 1 319 320 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_128                 1 1 320 321
Convolution              conv_80                  1 1 321 322 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_63                   2 1 318 322 323 0=0
Split                    splitncnn_48             1 3 323 324 325 326
ConvolutionDepthWise     convdw_215               1 1 326 327 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
ConvolutionDepthWise     convdw_216               1 1 325 328 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 7=256
BinaryOp                 add_64                   2 1 327 328 329 0=0
BinaryOp                 add_65                   2 1 329 324 330 0=0
BatchNorm                bn_18                    1 1 330 331 0=256 1=1.000000e-05
Split                    splitncnn_49             1 2 331 332 333
Convolution              conv_81                  1 1 333 334 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_129                 1 1 334 335
Convolution              conv_82                  1 1 335 336 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_66                   2 1 332 336 337 0=0
Split                    splitncnn_50             1 2 337 338 339
ConvolutionDepthWise     convdw_217               1 1 339 340 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2304 7=256
Convolution              conv_83                  1 1 340 341 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Split                    splitncnn_51             1 2 341 342 343
Convolution              conv_84                  1 1 343 344 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
GELU                     gelu_130                 1 1 344 345
Convolution              conv_85                  1 1 345 346 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
BinaryOp                 add_67                   2 1 342 346 347 0=0
Split                    splitncnn_52             1 3 347 348 349 350
ConvolutionDepthWise     convdw_218               1 1 350 351 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
ConvolutionDepthWise     convdw_219               1 1 349 352 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 7=512
BinaryOp                 add_68                   2 1 351 352 353 0=0
BinaryOp                 add_69                   2 1 353 348 354 0=0
BatchNorm                bn_19                    1 1 354 355 0=512 1=1.000000e-05
Split                    splitncnn_53             1 2 355 356 357
Reduction                mean_176                 1 1 357 358 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_8               1 1 358 359 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convsigmoid_24           1 1 359 360 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=4
BinaryOp                 mul_70                   2 1 356 360 361 0=2
Split                    splitncnn_54             1 2 361 362 363
Convolution              conv_88                  1 1 363 364 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
GELU                     gelu_131                 1 1 364 365
Convolution              conv_89                  1 1 365 366 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
BinaryOp                 add_71                   2 1 362 366 367 0=0
Split                    splitncnn_55             1 3 367 368 369 370
ConvolutionDepthWise     convdw_220               1 1 370 371 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
ConvolutionDepthWise     convdw_221               1 1 369 372 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 7=512
BinaryOp                 add_72                   2 1 371 372 373 0=0
BinaryOp                 add_73                   2 1 373 368 374 0=0
BatchNorm                bn_20                    1 1 374 375 0=512 1=1.000000e-05
Split                    splitncnn_56             1 2 375 376 377
Convolution              conv_90                  1 1 377 378 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
GELU                     gelu_132                 1 1 378 379
Convolution              conv_91                  1 1 379 380 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
BinaryOp                 add_74                   2 1 376 380 381 0=0
Convolution              conv_92                  1 1 52 382 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Convolution              conv_93                  1 1 110 383 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_94                  1 1 338 384 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Convolution              conv_95                  1 1 381 385 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Split                    splitncnn_57             1 2 385 386 387
Interp                   upsample_nearest_158     1 1 387 388 0=1 3=32 4=32 6=0
BinaryOp                 add_75                   2 1 384 388 389 0=0
Split                    splitncnn_58             1 2 389 390 391
Interp                   upsample_nearest_159     1 1 391 392 0=1 3=64 4=64 6=0
BinaryOp                 add_76                   2 1 383 392 393 0=0
Split                    splitncnn_59             1 2 393 394 395
Interp                   upsample_nearest_160     1 1 395 396 0=1 3=128 4=128 6=0
BinaryOp                 add_77                   2 1 382 396 397 0=0
Convolution              conv_96                  1 1 397 398 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Convolution              conv_97                  1 1 394 399 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Convolution              conv_98                  1 1 390 400 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Convolution              conv_99                  1 1 386 401 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Convolution              convrelu_9               1 1 398 402 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
Convolution              convrelu_10              1 1 399 403 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
Interp                   upsample_161             1 1 403 404 0=2 3=128 4=128 6=0
BinaryOp                 add_78                   2 1 402 404 405 0=0
Convolution              convrelu_11              1 1 400 406 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
Interp                   upsample_162             1 1 406 407 0=2 3=64 4=64 6=0
Convolution              convrelu_12              1 1 407 408 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Interp                   upsample_163             1 1 408 409 0=2 3=128 4=128 6=0
BinaryOp                 add_79                   2 1 405 409 410 0=0
Convolution              convrelu_13              1 1 401 411 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
Interp                   upsample_164             1 1 411 412 0=2 3=32 4=32 6=0
Convolution              convrelu_14              1 1 412 413 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Interp                   upsample_165             1 1 413 414 0=2 3=64 4=64 6=0
Convolution              convrelu_15              1 1 414 415 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Interp                   upsample_166             1 1 415 416 0=2 3=128 4=128 6=0
BinaryOp                 add_80                   2 1 410 416 417 0=0
Convolution              conv_107                 1 1 417 418 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
Interp                   upsample_167             1 1 418 out0 0=2 3=512 4=512 6=0
